Revit 2026 API

# EntityIsValid Method

---

Checks whether this Entity has a live Schema corresponding to it.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValid()
```
```vb
Public Function IsValid As Boolean
```
```cpp
public:
bool IsValid()
```
```fsharp
member IsValid : unit -> bool
```

#### Return Value

Boolean True if the Entity is valid.

Invalid entities may be used as token values. E.g., setting an invalid subentity is equivalent to deleting the stored one.

#### Reference

Entity Class

Autodesk.Revit.DB.ExtensibleStorage Namespace